cavityInternalHeated/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scalarSource
{
    type            scalarSemiImplicitSource;
//    duration        0.0;
    selectionMode   cellZone;
	cellZone		extForce;

	volumeMode      specific;

    injectionRateSuSp
    {
        T           (100 0);
    }
}


// ************************************************************************* //
