cavityInternalHeated/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // porousBlockage
    {
        name    ForceCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.04 0.04 -1) (0.06 0.06 1);
    }
    {
        name    extForce;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     ForceCellSet;
    }
);

// ************************************************************************* //
